/**
 * 7. Зграя драконів**
 * Це олімпіадна задача. Чисто як тренування мозку
 * Є переказ, що дракони бувають багатоголові. І чим більше голів у дракона, тим більша сила підвладна йому.
 * Але страшнішим за дракона може бути тільки зграя драконів. І страшна та зграя тим, що сила її не сумується від голів драконів, а примножується.
 * Якщо в зграї тієї 3 дракона з 2, 4 і 5 головами, то загальною силою вони можуть пооперувати з міфічним 40-головим іродовим драконищем.
 * Тому Вам, волхви шановні, належить написати закляття мудрене. Лазутчики голови порахують здалеку, а ваше завдання сказати, якою може бути максимальна сила тієї зграї.
 * До чого готуватися захисникам бравим, які заклинання готувати чарівникам сивоволосим.
 */
