/**
 * Калькулятор
Написати функцію – калькулятор. Функція приймає рядок з прикладом, визначає, яка дія необхідна виконати (+ - * /), переводить операнди у числа, вирішує приклад та повертає результат.

calc(12, 4, '+') //16
calc(1, 4, '-') //-3
calc(12, 5, '/') //2.4
calc(1.2, 3, '*') //3.6
 */

function calc(a, b, c) {
  let res = 0;
  c === '+'
    ? (res = a + b)
    : c === '-'
    ? (res = a - b)
    : c === '*'
    ? (res = +(a * b) * 10 / 10)//.toFixed(2))
    : c === '/'
    ? (res = +(a / b))
    : console.log(`Uncorrect input`);
  console.log(res);
}

calc(12, 4, '+'); //16
calc(1, 4, '-'); //-3
calc(12, 5, '/'); //2.4
calc(1.2, 3, '*'); //3.6
